In [2]:
import pandas as pd
import numpy as np

In [11]:
#data frame can take in a dictionary
df = pd.DataFrame({'Person':['sam','bob','charlie','ann'],
                 'Company':['Google','nvidia','something','Google']})

In [12]:
df

     Company   Person
0     Google      sam
1     nvidia      bob
2  something  charlie
3     Google      ann

In [15]:
df.groupby('Company').count()

Person    2
dtype: int64

In [19]:
df.groupby('Company').describe().transpose()

Company       Google nvidia something
Person count       2      1         1
       unique      2      1         1
       top       ann    bob   charlie
       freq        1      1         1